import numpy as np
# 1] 배열의 인덱싱
x = np.array( [10,20,30,40,50] )
print(x[0])  # 10
print(x[-2]) # 40
print( x[ [0,2] ]) # [10 , 30] [[특정인덱스,특정인데스]]
print( x[ x > 20 ] )        # [논리조건]    #[ 30 40 50 ]


# 2] 2차원 인덱싱 
x = np.array( [ [1,2,3] , [4,5,6] , [7,8,9] ] )
print( x[0,0] )     # 0행 0열   # 1
print( x[ 1, 2])    # 1행 2열   # 6
print( x[-1 , -1 ] ) # 마지막행 마지막 열   #9
print( x[ x>5 ])    # [ 6 7 8 9 ]


# 3] 슬라이싱  , [시작인덱스 : 끝 인덱스-1 : 단계 ]
x = np.array( [ 10, 20 , 30 , 40 , 50 ] )
print( x [ 1 : 4] )     # 20 30 40 
print( x[ : 3])         # 시작인덱스 생략시 0 # 10 20 30 ]
print( x[ -3 : ])       # 끝인덱스 생략시 마지막 인덱스 # 30 40 50 
print( x[ : : 2 ] )     # 2칸씩 이동 # [ 10 30  50 ]



# 4] 행슬라이싱 , 열슬라이싱 따로 해야됨.
x = np.array([[1,2,3] , [4,5,6] , [7,8,9]] )
# print( x[행슬라이싱] , x[열슬라이싱] )
print( x[ : , 1 ] ) # 행: 전체 , 열 : 1 #[2 5 8]
print( x[ 1 , : ] ) # 행: 1행 , 열 : 전체 # [4 5 6]
print( x[ 0:2 , 1:3] )


# 5] 슬라이싱 주의할점  
x = np.array( [ 10,20,30,40,50 ] )
y = x[ 1:4 ]    # [20,30,40] 
y[0] = 100
print( x )      # 원본 확인 했더니 . 원본도 같이 변경
# 파괴적임

y2 = x[1:4].copy()
y2[0] = 1000
print( x ) 


# 6] 배열의 연산
x = np.array( [1,2,3] )
y = np.array( [4,5,6] )
print( x + y )  # 같은 위치 끼리더합
print(x*y)
print(x**2)
print(np.sqrt(x))   # 제곱근 / 루트 
print( x > 2)
print( ( x > 1 ) & (x < 3) )    # (조건1) & (조건2)     , AND
print( ( x == 1 ) | ( x == 3 ) )    # (조건1) | (조건2) , OR
print( x > y)

# 배열 간 비교/연산 : 같은 위치끼리 연산/비교
# 스칼라(단일숫자)  와 배열 비교/연산 : T/F 또는 결과